app/views/favorites/_favorite.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                  <%= link_to book_favorites_path(books), method: :delete, remote: true do %>
                    <font color="red">♥<%= books.favorites.count %></font>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                  <%= link_to book_favorites_path(books), method: :post, remote: true do %>
                    ♥<%= books.favorites.count %>