app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                  <%= link_to book_favorites_path(books), method: :delete do %>
                    <font color="red">♥<%= books.favorites.count %></font>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                  <%= link_to book_favorites_path(books), method: :post do %>
                    ♥<%= books.favorites.count %>

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
            <td>
              <%= link_to "コメント数：#{books.book_comments.count}", book_path(books.id) %>