app/views/books/index.html.erb

            <td>
              <%= link_to "コメント数：#{books.book_comments.count}", book_path(books.id) %>
---
SELECT "books".* FROM "books"