app/views/books/show.html.erb

            <td>
              <%= link_to "コメント数：#{@books.book_comments.count}", book_path(@books.id) %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]