app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:notice] = "Book was created successfully"
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "1"], ["body", "1"], ["created_at", "2021-06-02 20:47:39.696681"], ["updated_at", "2021-06-02 20:47:39.696681"], ["user_id", 1]]
SELECT "books".* FROM "books"

  def index
    @book = Book.new
    @books = Book.all.sort {|a,b| b.favorited_users.count <=> a.favorited_users.count}
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

  def show
    @book = Book.new
    @books = Book.find(params[:id])
    @user = User.find(@books.user.id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]